app/controllers/tasks_controller.rb

  def create
    @task = Task.new(name: params[:task][:name], description: params[:task][:description], due: params[:task][:due]) #instantiate a new book
    if @task.save # save returns true if the database insert succeeds
---
INSERT INTO "tasks" ("name", "description", "due", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Lunch Out"], ["description", "Meet with Mentor at 8am "], ["due", "Friday, September 20"], ["created_at", "2018-09-19 21:47:32.745039"], ["updated_at", "2018-09-19 21:47:32.745039"]]