app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" ORDER BY "tasks"."name" ASC
---
  def index
    @tasks = Task.all.order(:name)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    id = params[:id]
    @task = Task.find_by(id: id)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def edit
    id = params[:id].to_i
    @task = Task.find_by(id: id)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "tasks" SET "description" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["description", "EvergladesBuy a tent!"], ["updated_at", "2018-09-21 20:44:03.287369"], ["id", 11]]
UPDATE "tasks" SET "due" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["due", "Friday, September 20"], ["updated_at", "2018-09-21 19:39:38.365144"], ["id", 11]]
---
  def update
    id = params[:id].to_i
    @task = Task.find_by(id: id)
    @task.update(task_params)
    # @task.name = params[:task][:name]
    # @task.description = params[:task][:description]
    # @task.due = params[:task][:due]
    if @task.save

INSERT INTO "tasks" ("name", "description", "due", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "asdfa"], ["description", "sdfsd"], ["due", ""], ["created_at", "2018-09-21 20:25:32.916561"], ["updated_at", "2018-09-21 20:25:32.916561"]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 3]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 14]]
UPDATE "tasks" SET "due" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["due", nil], ["updated_at", "2018-09-21 20:25:38.854197"], ["id", 14]]
---
  def create
    @task = Task.new(task_params)
    # @task = Task.new(name: params[:task][:name], description: params[:task][:description], due: params[:task][:due]) #instantiate a new book
    if @task.save # save returns true if the database insert succeeds
      redirect_to root_path # go to the index so we can see the book in the list
    else # save failed :(
      render :new # show the new book form view again
    end
  end

  def destroy
    id = params[:id].to_i
    @task = Task.find_by(id: id)
    if @task.destroy
      redirect_to root_path
    end
  end

  def status
    id = params[:id].to_i
    @task = Task.find_by(id: id)
    if @task.due.class == String
      @task.due = nil
    else @task.due == nil
      @task.due = "Completed on #{Date.today}"
    end
    @task.save